<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Faq;

class FaqsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $categories = [
            ['question:ar' => 'عل والقرى الساحة حدى. في الأجل','answer:ar'=>'عل والقرى الساحة حدى. في الأجل السفن واُسدل وصل, فقد وقام ساعة بأضرار أي. ٣٠ ألمّ عملية ذات, انه تم منتصف ممثّلة, مايو والقرى الأرضية بين أم. أصقاع باستحداث نفس من. عل ضرب تونس مشاركة شموليةً, بها جيوب أفاق أوزار ان. تم دون وتنصيب وإيطالي. مما فرنسا السيء أي, وعلى إبّان و بعد'],
            ['question:ar' => 'عل والقرى الساحة حدى. في الأجل','answer:ar'=>'عل والقرى الساحة حدى. في الأجل السفن واُسدل وصل, فقد وقام ساعة بأضرار أي. ٣٠ ألمّ عملية ذات, انه تم منتصف ممثّلة, مايو والقرى الأرضية بين أم. أصقاع باستحداث نفس من. عل ضرب تونس مشاركة شموليةً, بها جيوب أفاق أوزار ان. تم دون وتنصيب وإيطالي. مما فرنسا السيء أي, وعلى إبّان و بعد'],
            ['question:ar' => 'عل والقرى الساحة حدى. في الأجل','answer:ar'=>'عل والقرى الساحة حدى. في الأجل السفن واُسدل وصل, فقد وقام ساعة بأضرار أي. ٣٠ ألمّ عملية ذات, انه تم منتصف ممثّلة, مايو والقرى الأرضية بين أم. أصقاع باستحداث نفس من. عل ضرب تونس مشاركة شموليةً, بها جيوب أفاق أوزار ان. تم دون وتنصيب وإيطالي. مما فرنسا السيء أي, وعلى إبّان و بعد'],
            ['question:ar' => 'عل والقرى الساحة حدى. في الأجل','answer:ar'=>'عل والقرى الساحة حدى. في الأجل السفن واُسدل وصل, فقد وقام ساعة بأضرار أي. ٣٠ ألمّ عملية ذات, انه تم منتصف ممثّلة, مايو والقرى الأرضية بين أم. أصقاع باستحداث نفس من. عل ضرب تونس مشاركة شموليةً, بها جيوب أفاق أوزار ان. تم دون وتنصيب وإيطالي. مما فرنسا السيء أي, وعلى إبّان و بعد'],
            ['question:ar' => 'عل والقرى الساحة حدى. في الأجل','answer:ar'=>'عل والقرى الساحة حدى. في الأجل السفن واُسدل وصل, فقد وقام ساعة بأضرار أي. ٣٠ ألمّ عملية ذات, انه تم منتصف ممثّلة, مايو والقرى الأرضية بين أم. أصقاع باستحداث نفس من. عل ضرب تونس مشاركة شموليةً, بها جيوب أفاق أوزار ان. تم دون وتنصيب وإيطالي. مما فرنسا السيء أي, وعلى إبّان و بعد']
        ];

        foreach ($categories as $category) {
            Faq::create($category);
        }
    }
}
